#include "bh1750.h"
#include "ls1x.h"
#include "ls1x_common.h"

uint8_t BUF[2]={0};
uint16_t result1750=0;
/**************************************************************
*功  能：端口初始化
*参  数: 无
*返回值: 无 
**************************************************************/
void BH1750_Init(void)
{
	myIIC_Init(); 
}
/**************************************************************
*功  能：发送设备地址
*参  数: 无
*返回值: 无 
**************************************************************/
void Cmd_Write_BH1750(uint8_t cmd)
{
    myIIC_Start();						//起始信号
    myIIC_Send_Byte(BH1750_Addr+0);		//发送设备地址+写信号
	while(myIIC_Wait_Ack());
    myIIC_Send_Byte(cmd);				//内部寄存器地址
	while(myIIC_Wait_Ack());
    myIIC_Stop();						//发送停止信号
	delay_ms(5);
}


/**************************************************************
*功  能：开启一次H分辨率模式
*参  数: 无
*返回值: 无 
**************************************************************/
void Start_BH1750(void)
{
	Cmd_Write_BH1750(BH1750_ON);	 	//power on
	Cmd_Write_BH1750(BH1750_RSET);		//clear
	Cmd_Write_BH1750(BH1750_ONE);  		//一次H分辨率模式，至少120ms，之后自动断电模式  
}

/**************************************************************
*功  能：读光照信号
*参  数: 无
*返回值: 无 
**************************************************************/
void Read_BH1750(void)
{
    myIIC_Start();							//起始信号
    myIIC_Send_Byte(BH1750_Addr+1);		//发送设备地址+读信号
	while(myIIC_Wait_Ack());
	BUF[0]=myIIC_Read_Byte(1);				//发送ACK
	BUF[1]=myIIC_Read_Byte(0);				//发送NACK
    myIIC_Stop();							//停止信号
    delay_ms(5);
}

/**************************************************************
*功  能：合成光照数据
*参  数: 无
*返回值: 无 
**************************************************************/
unsigned short Convert_BH1750(void)
{
	result1750=BUF[0];
	result1750=(result1750<<8)+BUF[1];		//合成数据，即光照数据
	return result1750=result1750/1;
}

/**************************************************************
*功  能：显示光照数据
*参  数: 无
*返回值: 无 
**************************************************************/
unsigned short BH1750_Test()
{
	char show[50];
	
	Start_BH1750();						//开启一次H分辨率模式
    delay_ms(120);						//延时120ms
    Read_BH1750();						//连续读取结果 到BUF里面 
    return Convert_BH1750();					//转换结果到result_lx
	
 
	 //sprintf(show, "guangzao:%3d Lx ",result1750);                 // 串口0  要发送的字符串
       // OLED_Show_Str(0, 0, show, 16); 
}


